#здесь я ввожу переменную z, в которую вводится радиус
z = int(input("Добрый день! введите радиус круга в см"))
#здесь я решил ввести переменную для вывода длины окружности
d = 2*3.14*z
#здесь я решил ввести переменную для вывода площади окружности
p = 3.14*z*z
#здесь я вывожу переменную длины окружности в см и м
print (f"Длина окружности: {d} см или {d/100} м")
#здесь я вывожу переменную площади в см^2 и м^2
print (f"Площадь круга: {p} см² или {p/10000} м² ")
#здесь я решил, что легче не вводить новые переменные, а писать вычисления в инпуте, вывел сторону впис в окр квадрата, 
#чтобы умножить на корень из двух, я умножил на два в степени 0.5, чтобы не качать расширения, потому что мало time
print (f"Сторона вписанного в окружность квадрата: {z * 2**0.5} см или {(z * 2**0.5) / 100} м ")
#здесь я вывел сторону впис в окр равност треуг, посчитав по формуле
print (f"Сторона вписанного в окружность равностороннего треугольника: {z * 3**0.5} см или {(z * 3**0.5) / 100} м ")
#здесь я вывел сторону опис во круг окр квадрата, посчитав по формуле
print (f"Сторона описанного во круг окружности квадрата: {2*z} см или {2*z / 100} м ")
#здесь я вывел сторону опис во круг окр равностр треуг, посчитав по формуле
print (f"Сторона описанного во круг окружности равностороннего треугольника: {2*z*3**0.5} см или {(2*z*3**0.5) / 100} м ")
#здесь я вывел сторону опис во круг окр восьмиугольнника, посчитав по формуле
print (f"Сторона описанного во круг окружности восьмиугольника: {2*z*(2**0.5 - 1)} см или {(2*z*(2**0.5 - 1)) / 100} м ")

